app/controllers/cat_rental_requests_controller.rb

  def new
    @request = CatRentalRequest.new
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def create
    @request = CatRentalRequest.new(request_params)

    if @request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2021-06-30"], ["end_date", "2021-07-02"], ["created_at", "2021-06-15 16:04:21.172672"], ["updated_at", "2021-06-15 16:04:21.172672"]]

  def approve
    @request = CatRentalRequest.find_by(id: params[:id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def deny
    @request = CatRentalRequest.find_by(id: params[:id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]