app/controllers/cats_controller.rb

  def show
    @cat = Cat.find_by(id: params[:id])
    @requests = CatRentalRequest.where(cat_id: @cat.id).order(:start_date)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 1]]

  def create
    @cat = Cat.new(cat_params)
    @cat.owner = current_user

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @cat = current_user.cats.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    @cat = current_user.cats.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Black"], ["description", "    Natalie's cat\r\n  "], ["updated_at", "2021-06-16 05:17:50.029487"], ["id", 2]]