app/models/cat_rental_request.rb

  def approve!
    raise 'not pending' unless self.pending?
    transaction do
      self.status = 'APPROVED'
      self.save!

      overlapping_pending_requests.each do |req|
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-06-15 17:38:41.377540"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (cat_id = 1 AND start_date <= '2021-03-04' AND end_date >= '2021-01-04' AND id != 1) AND (status = 'PENDING')

  def deny!
    self.status = 'DENIED'
    self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-06-15 18:07:46.768166"], ["id", 6]]

  def overlapping_requests
    rental_requests = CatRentalRequest.where('cat_id = ? AND start_date <= ? AND end_date >= ? AND id != ?',
                            self.cat_id, self.end_date, self.start_date, self.id)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def does_not_overlap_approved_request
    return if self.denied?
    unless overlapping_approved_requests.empty?
---
SELECT 1 AS one FROM "cat_rental_requests" WHERE (cat_id = 1 AND start_date <= '2021-06-14' AND end_date >= '2021-06-12' AND id != 3) AND (status = 'APPROVED') LIMIT $1  [["LIMIT", 1]]