app/models/user.rb

  def self.find_by_credentials(user_name, password)
    user = User.find_by(user_name: user_name)
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "drew_kreins"], ["LIMIT", 1]]

  def owns_cat?(cat)
    self.cats.include?(cat)
---
SELECT 1 AS one FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]